**Lab 1: REVIEW - CLEAN DATA WITH PYTHON**

In [141]:
import pandas as pd

# Dealing with multiple files

- The power of pandas is mainly in being able to manipulate large amounts of structured data. We want to get all of the relevant information into one table so that we can analyze the aggregate data.
- We can combine the use of `glob`, a Python library for working with files.

1. We have 10 different files containing 100 students each. We are going to import each file using pandas, and combine all of the entries into one DataFrame.

In [155]:
import glob
student_files = glob.glob('1exam*.csv')

In [157]:
student_files

['1exam0.csv',
 '1exam1.csv',
 '1exam2.csv',
 '1exam3.csv',
 '1exam4.csv',
 '1exam5.csv',
 '1exam6.csv',
 '1exam7.csv',
 '1exam8.csv',
 '1exam9.csv']

2. Create an empty list called df_list that will store all of the DataFrames
3. Loop through the filenames in student_files, and create a DataFrame from each file. Append this DataFrame to df_list.

In [159]:
df_list = []

In [161]:
for exam in student_files:
    df_list.append(pd.read_csv(exam))

In [163]:
df_list

[    id         full_name gender_age fractions probability       grade
 0    0    Barrett Feragh        M14       76%         72%   9th grade
 1    1   Llewellyn Keech        M14       83%         NaN  12th grade
 2    2   Llewellyn Keech        M14       83%         NaN  12th grade
 3    3      Terrell Geri        M15       80%         86%  11th grade
 4    4    Gram Hallewell        M14       67%         78%  10th grade
 ..  ..               ...        ...       ...         ...         ...
 95  95     Halley Clunie        F14       73%         82%  12th grade
 96  96    Gale Mullender        F17       72%         81%  12th grade
 97  97        Ryun Denne        M17       74%         78%  11th grade
 98  98  Cazzie Potapczuk        M14       71%         78%  10th grade
 99  99     Verina Pasque        F18       48%         77%  10th grade

 [100 rows x 6 columns],
     id          full_name gender_age fractions probability       grade
 0    0  Roseanna Gwinnell        F15       89%         65%   9th grade
 1    1  Ellissa Childrens        F14       73%         84%  12th grade
 2    2      Reeta Bramich        F18       74%         92%  12th grade
 3    3       Izabel Rymer        F15       66%         81%  11th grade
 4    4      Rosalie Donne        F18       72%         86%  11th grade
 ..  ..                ...        ...       ...         ...         ...
 95  95   Brig Meadowcroft        M16       84%         NaN  12th grade
 96  96   Isidor Abrashkov        M14       83%         78%  11th grade
 97  97       Siana McKune        F17       72%         76%  12th grade
 98  98        Tuck Lyford        M17       73%         84%  11th grade
 99  99        Janie Paris        F17       68%         82%  11th grade

 [100 rows x 6 columns],
     id          full_name gender_age fractions probability       grade
 0    0  Kizzee Kensington        F17       68%         76%  12th grade
 1    1   Garret Hartfleet        M17       68%         90%  12th grade
 2    2    Ingrid Meatyard        F18       65%         NaN  12th grade
 3    3  Verney Sainsberry        M18       85%         76%   9th grade
 4    4    Lonni Bruhnicke        F16       71%         81%   9th grade
 ..  ..                ...        ...       ...         ...         ...
 95  95      Massimo Babbs        M16       84%         83%  11th grade
 96  96     Garrek Manuely        M14       70%         85%   9th grade
 97  97   Winslow Lilliman        M15       81%         83%  11th grade
 98  98      Grantham Yate        M15       77%         87%  10th grade
 99  99    Dennie Chopping        M16       81%         83%   9th grade

 [100 rows x 6 columns],
     id         full_name gender_age fractions probability       grade
 0    0  Nikolia Rainsdon        F15       66%         74%  11th grade
 1    1    Libbie MacIver        F15       71%         83%  10th grade
 2    2    Caesar Arnison        M16       70%         78%  12th grade
 3    3     Leanora Cowup        F15       72%         74%   9th grade
 4    4     Leanora Cowup        F15       72%         74%   9th grade
 ..  ..               ...        ...       ...         ...         ...
 95  95     Donia Stockoe        F18       88%         84%  10th grade
 96  96   Korella Spurden        F16       79%         81%   9th grade
 97  97     Basilius Sine        M17       66%         85%  10th grade
 98  98  Kingston Akaster        M14       71%         75%   9th grade
 99  99     Carita Utting        F16       68%         83%  11th grade

 [100 rows x 6 columns],
     id             full_name gender_age fractions probability       grade
 0    0        Luci Carwithim        F15       79%         79%  12th grade
 1    1          Terrel Vosse        M18       74%         83%  10th grade
 2    2           Cecil Celli        M18       70%         81%  10th grade
 3    3  Tiffany Brocklehurst        F15       66%         84%  10th grade
 4    4  Lionello Claricoates        M18       NaN         NaN   9th grade
 ..  ..                   ...        ...       ...         ...         ...
 95  95       Denyse Dodgshun        F15       66%         81%  10th grade
 96  96       Alphard Ackland        M17       58%         NaN  10th grade
 97  97      Bernie Bettridge        M14       74%         83%  12th grade
 98  98          Rodd Ahearne        M16       79%         81%   9th grade
 99  99        Adolphe Neljes        M17       64%         87%  10th grade

 [100 rows x 6 columns],
     id          full_name gender_age fractions probability       grade
 0    0         Gigi Erley        F14       63%         83%  10th grade
 1    1    Madelaine Drees        F14       73%         83%  10th grade
 2    2   Nevins O'Sesnane        M16       NaN         88%   9th grade
 3    3     Sonnie Yukhnev        F14       83%         74%  11th grade
 4    4      Boigie Kaindl        M15       81%         81%  11th grade
 ..  ..                ...        ...       ...         ...         ...
 95  95        Arel Sissot        M15       70%         NaN   9th grade
 96  96   Ardath Castleton        F16       75%         81%  10th grade
 97  97  Gregor Shingfield        M18       80%         78%  11th grade
 98  98     Anette Snawden        F17       79%         83%  11th grade
 99  99   Thurston Braiden        M14       NaN         86%   9th grade

 [100 rows x 6 columns],
     id           full_name gender_age fractions probability       grade
 0    0      Moses Kirckman        M14       69%         89%  11th grade
 1    1     Timofei Strowan        M18       63%         76%  11th grade
 2    2        Silvain Poll        M18       69%         77%   9th grade
 3    3      Lezley Pinxton        M18       NaN         72%  11th grade
 4    4   Bernadene Saunper        F17       72%         84%  11th grade
 ..  ..                 ...        ...       ...         ...         ...
 95  95        Bria Seiller        F15       72%         81%  12th grade
 96  96      Lilyan Cicutto        F14       88%         81%  12th grade
 97  97     Grantham Maykin        M16       75%         76%  11th grade
 98  98     Doralyn Bartels        F14       85%         84%  12th grade
 99  99  Mariam Hallyburton        F18       80%         87%   9th grade

 [100 rows x 6 columns],
     id       full_name gender_age fractions probability       grade
 0    0   Morissa Skade        F16       72%         70%  10th grade
 1    1  Jasper Comfort        M14       76%         73%   9th grade
 2    2    Siana Pallas        F18       58%         77%  10th grade
 3    3    Aldous Peele        M16       86%         83%   9th grade
 4    4  Ethelred Easun        M14       85%         NaN  12th grade
 ..  ..             ...        ...       ...         ...         ...
 95  95      Eva Briant        F16       71%         NaN  11th grade
 96  96   Velvet Reedie        F15       76%         80%  12th grade
 97  97   Garv Leathlay        M16       69%         81%  10th grade
 98  98     Margit Read        F14       84%         NaN   9th grade
 99  99   Yurik Farrell        M18       68%         85%   9th grade

 [100 rows x 6 columns],
     id        full_name gender_age fractions probability       grade
 0    0    Andros Magnus        M14       73%         85%  11th grade
 1    1  Micheline Trent        F14       64%         81%   9th grade
 2    2   Denna Mackrill        F16       78%         70%  10th grade
 3    3   Maegan Ebbrell        F18       75%         77%  11th grade
 4    4    Nikki Dashper        M17       67%         81%  11th grade
 ..  ..              ...        ...       ...         ...         ...
 95  95   Wilie Stillert        F14       72%         69%   9th grade
 96  96   Gertie Flicker        F15       NaN         86%  11th grade
 97  97     Yettie Labes        F14       81%         82%  12th grade
 98  98   Lock McGuinley        M18       NaN         84%  10th grade
 99  99     Bebe Lebbern        F15       66%         91%  12th grade

 [100 rows x 6 columns],
     id         full_name gender_age fractions probability       grade
 0    0      Garwin Crust        M16       76%         78%   9th grade
 1    1      Orren Heater        M15       67%         94%  11th grade
 2    2    Chiquita Bains        F17       72%         77%  10th grade
 3    3     Shalom Vittet        M18       61%         85%  10th grade
 4    4   Lelia MacKenzie        F14       73%         79%  12th grade
 ..  ..               ...        ...       ...         ...         ...
 95  95          Maxi Dew        F16       77%         71%  10th grade
 96  96       Jewell Boas        F15       57%         90%  12th grade
 97  97      Lebbie Twine        F17       72%         91%  12th grade
 98  98     Garek Culbert        M14       64%         NaN  11th grade
 99  99  Cristine Warboys        F16       74%         74%  12th grade

 [100 rows x 6 columns]]

4. Concatenate all of the DataFrames in df_list into one DataFrame called students.

In [165]:
students= pd.concat(df_list)

In [169]:
students.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 0 to 99
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           1000 non-null   int64
 1   full_name    1000 non-null   object
 2   gender_age   1000 non-null   object
 3   fractions    932 non-null    object
 4   probability  929 non-null    object
 5   grade        1000 non-null   object
dtypes: int64(1), object(5)
memory usage: 54.7+ KB

# Reshaping your Data
- Each variable as a separate column
- Each row as a separate observation

In [171]:
# print out students head, students columns
students.columns

Index(['id', 'full_name', 'gender_age', 'fractions', 'probability', 'grade'], dtype='object')

In [173]:
students.head()

   id        full_name gender_age fractions probability       grade
0   0   Barrett Feragh        M14       76%         72%   9th grade
1   1  Llewellyn Keech        M14       83%         NaN  12th grade
2   2  Llewellyn Keech        M14       83%         NaN  12th grade
3   3     Terrell Geri        M15       80%         86%  11th grade
4   4   Gram Hallewell        M14       67%         78%  10th grade

There is a column for the scores on the fractions exam, and a column for the scores on the probabilities exam. We want to make each row an observation, so we want to transform this table to look like:

![Melting](Images/W2_Cleaning-melting.jpg)

The parameters you provide are:

- frame: the DataFrame you want to melt
- id_vars: the column(s) of the old DataFrame to preserve
- value_vars: the column(s) of the old DataFrame that you want to turn into variables
- value_name: what to call the column of the new DataFrame that stores the values
- var_name: what to call the column of the new DataFrame that stores the variables

In [175]:
students = pd.melt(frame = students, id_vars=['full_name','gender_age','grade'],value_vars= ['fractions','probability'],
        value_name = 'score', var_name='exam')

In [177]:
students.head()

         full_name gender_age       grade       exam score
0   Barrett Feragh        M14   9th grade  fractions   76%
1  Llewellyn Keech        M14  12th grade  fractions   83%
2  Llewellyn Keech        M14  12th grade  fractions   83%
3     Terrell Geri        M15  11th grade  fractions   80%
4   Gram Hallewell        M14  10th grade  fractions   67%

In [179]:
students.exam.unique()

array(['fractions', 'probability'], dtype=object)

# Dealing with Duplicates
Often we see duplicated rows of data in the DataFrames we are working with. This could happen due to errors in data collection or in saving and loading the data.

0. Short review

In [181]:
         data = pd.DataFrame({'k1': ['one','two']*3 + ['two'], 'k2':[1,1,2,3,3,4,4]})

In [183]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [185]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

The DataFrame method duplicated returns a Boolean Series indicating whether each row is a duplicate (its column values are exactly equal to those in an earlier row) or not

In [187]:
data.drop_duplicates()
#we only have 5 rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

`drop_duplicates` returns a DataFrame with rows where the duplicated
array is False filtered out

Both methods by default consider all of the columns; alternatively, you can specify any subset of them to detect duplicates.  
Suppose we had an additional column of values and wanted to filter duplicates based only on the "k1" column

In [189]:
data['v1'] = range(7)
data
# subset (thi con 2 gia tri )
#trung ten 'name' -> subset de check diem

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [191]:
data.drop_duplicates(subset='k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

`duplicated` and `drop_duplicates` by default keep the first observed value combination. 
Passing keep="last" will return the last one.

In [193]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

1. Make a Series object called duplicates to save rows recorded twice. Print out the value_counts of duplicates

In [195]:
duplicates = students.duplicated()
duplicates.value_counts()

False    1976
True       24
Name: count, dtype: int64

2. Update the value of students to be the students table with the duplicates dropped.

In [197]:

duplicates = students.drop_duplicates()
print(duplicates)

             full_name gender_age       grade         exam score
0       Barrett Feragh        M14   9th grade    fractions   76%
1      Llewellyn Keech        M14  12th grade    fractions   83%
3         Terrell Geri        M15  11th grade    fractions   80%
4       Gram Hallewell        M14  10th grade    fractions   67%
5       Stephana Boots        F18   9th grade    fractions   NaN
...                ...        ...         ...          ...   ...
1995          Maxi Dew        F16  10th grade  probability   71%
1996       Jewell Boas        F15  12th grade  probability   90%
1997      Lebbie Twine        F17  12th grade  probability   91%
1998     Garek Culbert        M14  11th grade  probability   NaN
1999  Cristine Warboys        F16  12th grade  probability   74%

[1976 rows x 5 columns]

In [199]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   full_name   2000 non-null   object
 1   gender_age  2000 non-null   object
 2   grade       2000 non-null   object
 3   exam        2000 non-null   object
 4   score       1861 non-null   object
dtypes: object(5)
memory usage: 78.3+ KB

# Splitting by Index
- Often, multiple measurements are recorded in the same column
- We can easily break the data into three separate columns by splitting the strings using `.str`

In [201]:
print(students.head())
#split depend on type

         full_name gender_age       grade       exam score
0   Barrett Feragh        M14   9th grade  fractions   76%
1  Llewellyn Keech        M14  12th grade  fractions   83%
2  Llewellyn Keech        M14  12th grade  fractions   83%
3     Terrell Geri        M15  11th grade  fractions   80%
4   Gram Hallewell        M14  10th grade  fractions   67%

The column `gender_age` sounds like it contains both gender and age!

1. Separate out the gender data into a new column called `gender`

In [203]:
students

             full_name gender_age       grade         exam score
0       Barrett Feragh        M14   9th grade    fractions   76%
1      Llewellyn Keech        M14  12th grade    fractions   83%
2      Llewellyn Keech        M14  12th grade    fractions   83%
3         Terrell Geri        M15  11th grade    fractions   80%
4       Gram Hallewell        M14  10th grade    fractions   67%
...                ...        ...         ...          ...   ...
1995          Maxi Dew        F16  10th grade  probability   71%
1996       Jewell Boas        F15  12th grade  probability   90%
1997      Lebbie Twine        F17  12th grade  probability   91%
1998     Garek Culbert        M14  11th grade  probability   NaN
1999  Cristine Warboys        F16  12th grade  probability   74%

[2000 rows x 5 columns]

In [205]:
students['gender'] = students.gender_age.str[0]
#M14 (0,1,2) -> str[0] for gender
students['gender']

0       M
1       M
2       M
3       M
4       M
       ..
1995    F
1996    F
1997    F
1998    M
1999    F
Name: gender, Length: 2000, dtype: object

2. Separate out the age data into a new column called `age`

In [207]:
students['age'] = students.gender_age.str[1:]
students['age']

0       14
1       14
2       14
3       15
4       14
        ..
1995    16
1996    15
1997    17
1998    14
1999    16
Name: age, Length: 2000, dtype: object

3. Save students dataframe without gender_age

In [209]:
students = students.drop('gender_age',axis=1)

In [211]:
students

             full_name       grade         exam score gender age
0       Barrett Feragh   9th grade    fractions   76%      M  14
1      Llewellyn Keech  12th grade    fractions   83%      M  14
2      Llewellyn Keech  12th grade    fractions   83%      M  14
3         Terrell Geri  11th grade    fractions   80%      M  15
4       Gram Hallewell  10th grade    fractions   67%      M  14
...                ...         ...          ...   ...    ...  ..
1995          Maxi Dew  10th grade  probability   71%      F  16
1996       Jewell Boas  12th grade  probability   90%      F  15
1997      Lebbie Twine  12th grade  probability   91%      F  17
1998     Garek Culbert  11th grade  probability   NaN      M  14
1999  Cristine Warboys  12th grade  probability   74%      F  16

[2000 rows x 6 columns]

# Splitting by Character

Sometimes, we have a column containing two types of data, but can't split using index as previous case. Instead, we will split by Character, such as '_', " ".

1. Create a Series object called name_split that splits the full_name by the " " character

In [213]:
students.head(2)
# split name based on space

         full_name       grade       exam score gender age
0   Barrett Feragh   9th grade  fractions   76%      M  14
1  Llewellyn Keech  12th grade  fractions   83%      M  14

2. Create a column called first_name that takes the first item in name_split

In [215]:
name_split = students['full_name'].str.split(' ')
name_split

0         [Barrett, Feragh]
1        [Llewellyn, Keech]
2        [Llewellyn, Keech]
3           [Terrell, Geri]
4         [Gram, Hallewell]
               ...
1995            [Maxi, Dew]
1996         [Jewell, Boas]
1997        [Lebbie, Twine]
1998       [Garek, Culbert]
1999    [Cristine, Warboys]
Name: full_name, Length: 2000, dtype: object

In [217]:
students['first_name'] = name_split.str.get(0)

3. Create a column called last_name that takes the second item in name_split.

In [219]:
# do minh khac tren xiu

In [221]:
students['last_name'] = name_split.str.get(1)
# do chi 2 gia tri (first and last)

In [223]:
students.head()

,full_name,grade,exam,score,gender,age,first_name,last_name
0,Barrett Feragh,9th grade,fractions,76%,M,14,Barrett,Feragh
1,Llewellyn Keech,12th grade,fractions,83%,M,14,Llewellyn,Keech
2,Llewellyn Keech,12th grade,fractions,83%,M,14,Llewellyn,Keech
3,Terrell Geri,11th grade,fractions,80%,M,15,Terrell,Geri
4,Gram Hallewell,10th grade,fractions,67%,M,14,Gram,Hallewell

# String manipulation

The dtypes that pandas uses are: float, int, bool, datetime, timedelta, category and object. Often, we want to convert between types so that we can do better analysis

In [225]:
students.dtypes

full_name     object
grade         object
exam          object
score         object
gender        object
age           object
first_name    object
last_name     object
dtype: object

1. Try to print out the mean of the score column os students

In [227]:
students.head()

,full_name,grade,exam,score,gender,age,first_name,last_name
0,Barrett Feragh,9th grade,fractions,76%,M,14,Barrett,Feragh
1,Llewellyn Keech,12th grade,fractions,83%,M,14,Llewellyn,Keech
2,Llewellyn Keech,12th grade,fractions,83%,M,14,Llewellyn,Keech
3,Terrell Geri,11th grade,fractions,80%,M,15,Terrell,Geri
4,Gram Hallewell,10th grade,fractions,67%,M,14,Gram,Hallewell

In [117]:
#students.scores.mean() -> errors
# we do the replace

2. We can't find the mean of the score because the data is stored as Object. 
--> Use regex to take out the % signs in the score column

In [229]:
students ['score'] =students['score'].replace(['%'], '',regex = True)
students ['score']

0        76
1        83
2        83
3        80
4        67
       ...
1995     71
1996     90
1997     91
1998    NaN
1999     74
Name: score, Length: 2000, dtype: object

3. Convert the score column to a numerical type using the pd.to_numeric() function

In [231]:
pd.to_numeric(students['score'])

0       76.0
1       83.0
2       83.0
3       80.0
4       67.0
        ...
1995    71.0
1996    90.0
1997    91.0
1998     NaN
1999    74.0
Name: score, Length: 2000, dtype: float64

Sometimes, the numbers are hidden within string values. We use Regex to extract this numerical data from the strings

4. The grade looks like "9th grade". Use regex to extract the number and store the values back into the grade

In [233]:
students

,full_name,grade,exam,score,gender,age,first_name,last_name
0,Barrett Feragh,9th grade,fractions,76,M,14,Barrett,Feragh
1,Llewellyn Keech,12th grade,fractions,83,M,14,Llewellyn,Keech
2,Llewellyn Keech,12th grade,fractions,83,M,14,Llewellyn,Keech
3,Terrell Geri,11th grade,fractions,80,M,15,Terrell,Geri
4,Gram Hallewell,10th grade,fractions,67,M,14,Gram,Hallewell
...,...,...,...,...,...,...,...,...
1995,Maxi Dew,10th grade,probability,71,F,16,Maxi,Dew
1996,Jewell Boas,12th grade,probability,90,F,15,Jewell,Boas
1997,Lebbie Twine,12th grade,probability,91,F,17,Lebbie,Twine
1998,Garek Culbert,11th grade,probability,NaN,M,14,Garek,Culbert
1999,Cristine Warboys,12th grade,probability,74,F,16,Cristine,Warboys

In [235]:
students['grade'] = students['grade'].str.extract(r'(\d+)').astype(int)

In [237]:
students['grade'].dtype
# int64

dtype('int32')

5. Convert the grade column to be numerical values

In [239]:
students['grade'] = students['grade'].astype(int)

In [241]:
students['grade'].head()

0     9
1    12
2    12
3    11
4    10
Name: grade, dtype: int32

6. Calculate the mean of grade

In [245]:
mean_grade = students['grade'].mean()
mean_grade

10.614